config/NASA_navyPylon_v2_tas120_aoa0_900T33/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//kInlet          0.01;
kInlet          10.00;

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $kInlet;
//internalField   uniform 100;

boundaryField
{
    freestream
    {
        type            inletOutlet;
        inletValue      uniform $kInlet;
        value           uniform $kInlet;
    }

    wall
    {
        type            kqRWallFunction;
        value           uniform $kInlet;
    }

    //pmsCanisterGroup
    //{
    //	type 		kqRWallFunction;
    //	value		uniform $kInlet;
    //}

    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
