config/NASA_navyPylon_v2_tas120_aoa0_900T33/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      mut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    freestream
    {
        type            calculated;
        value           uniform 0;
    }

    wall
    {
        type            nutkWallFunction;
	type		nutUSpaldingWallFunction;
        value           uniform 0;
    }
    
    //pmsCanisterGroup
    //{
    //    type            nutkWallFunction;
    //    value           uniform 0;
    //}

    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
