config/NASA_navyPylon_v2_tas120_aoa0_900T33/system/probes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields from cells nearest to specified locations.

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/probes/probes.cfg"

fields (p U T);
probeLocations
(
    (11.8 2.74 13.75)
    (12.0 2.74 13.75)
    (12.2 2.74 13.75)
    (12.4 2.74 13.75)
    (12.6 2.74 13.75)
    (12.8 2.74 13.75)
    (13.0 2.74 13.75)
    (13.2 2.74 13.75)
    (13.4 2.74 13.75)
    (13.6 2.74 13.75)
    (13.8 2.74 13.75)
    (14.0 2.74 13.75)
);

// ************************************************************************* //
