config/NASA_navyPylon_v2_tas120_aoa0_900T33/system/turbulenceFields
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates specified turbulence fields and stores it on the database.

\*---------------------------------------------------------------------------*/

type            turbulenceFields;
libs            ("libfieldFunctionObjects.so");

fields          (<field names>);

executeControl  writeTime;
writeControl    writeTime;

// ************************************************************************* //
